In [2]:
import pandas as pd

# Series

In [4]:
pd.Series( [1,2,3,4,5])

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [62]:
index_s = ['a', 'b', 'c', 'd','e']
ser = pd.Series( [1,2,3,4,5], index=index_s)
ser

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [64]:
#시리즈의 인덱싱
ser[0], ser['a']

#ser.loc[]
#ser.iloc[]

C:\Users\Admin\AppData\Local\Temp\ipykernel_17356\3063707491.py:2: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  ser[0], ser['a']

(np.int64(1), np.int64(1))

In [8]:
dict_data = {'a':1, 'b':2, 'c':3, 'd':4}
s3 = pd.Series(dict_data)
print(s3)

a    1
b    2
c    3
d    4
dtype: int64

In [11]:
ser2 = pd.Series([10, 'banana'])
type(ser2), ser2

(pandas.core.series.Series,
 0        10
 1    banana
 dtype: object)

In [65]:
population = pd.Series([ 9776, 2729, 1566, 3158], 
                       index=['서울', '부산', '인천', '대구'])
population['서울']
population[['서울', '부산']] #0,1  팬시인덱싱
population

서울    9776
부산    2729
인천    1566
대구    3158
dtype: int64

In [16]:
population.info()

<class 'pandas.core.series.Series'>
Index: 4 entries, 서울 to 대구
Series name: None
Non-Null Count  Dtype
--------------  -----
4 non-null      int64
dtypes: int64(1)
memory usage: 236.0+ bytes

In [19]:
#ser[0], ser['a']
ser.iloc[0], ser.loc['a']

(np.int64(1), np.int64(1))

# DataFrame

In [69]:
scientists = pd.DataFrame({
        "Name": ["Rosaline Franklin", "William Gosset"],
        "Occupation": ["Chemist", "Statistician"],
        "Born": ["1920-07-25", "1876-06-13"],
        "Died": ["1958-04-16", "1937-10-16"],
        "Age": [37, 61],
})
scientists.index

RangeIndex(start=0, stop=2, step=1)

```
iloc[] : indexlocator
loc[] : locator
```

In [66]:
scientists.columns

Index(['Name', 'Occupation', 'Born', 'Died', 'Age'], dtype='object')

In [70]:
scientists.index

RangeIndex(start=0, stop=2, step=1)

In [ ]:
scientists.iloc[1] #-1이 되어 있다

Name          William Gosset
Occupation      Statistician
Born              1876-06-13
Died              1937-10-16
Age                       61
Name: 1, dtype: object

In [ ]:
scientists['Name'] #시리즈

0    Rosaline Franklin
1       William Gosset
Name: Name, dtype: object

In [73]:
scientists.index = ['Rosaline Franklin', 'William Gosset']

In [74]:
scientists

,Name,Occupation,Born,Died,Age
Rosaline Franklin,Rosaline Franklin,Chemist,1920-07-25,1958-04-16,37
William Gosset,William Gosset,Statistician,1876-06-13,1937-10-16,61

In [75]:
#인덱스로 행 추출
scientists.loc['William Gosset']

Name          William Gosset
Occupation      Statistician
Born              1876-06-13
Died              1937-10-16
Age                       61
Name: William Gosset, dtype: object

In [ ]:
#[행,열] 인덱싱
scientists.loc['William Gosset', 'Born']

'1876-06-13'

In [78]:
#[시작행:끝행, 시작열:끝열]  #쉼표는 행과열 > 차원을 구분
scientists.iloc[:, 0:2]

                                Name    Occupation
Rosaline Franklin  Rosaline Franklin       Chemist
William Gosset        William Gosset  Statistician

In [80]:
sci1 = pd.DataFrame({
        "Name": ["Rosaline Franklin", "William Gosset"],
        "Occupation": ["Chemist", "Statistician"],
        "Born": ["1920-07-25", "1876-06-13"],
        "Died": ["1958-04-16", "1937-10-16"],
        "Age": [37, 61],
})

# 데이터 미리보기

In [32]:
sci1

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [31]:
sci1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2 entries, 0 to 1
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        2 non-null      object
 1   Occupation  2 non-null      object
 2   Born        2 non-null      object
 3   Died        2 non-null      object
 4   Age         2 non-null      int64
dtypes: int64(1), object(4)
memory usage: 212.0+ bytes

In [81]:
sci1

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [ ]:
sci1.loc[0,'Name'] #[row, col] 인덱싱

'Rosaline Franklin'

In [ ]:
#iloc로 william gosset의 age 추출

In [ ]:
#born, died 만 추출

In [ ]:
#occupation만 추출

In [ ]:
sci1.to_csv('./data/scientist_1.csv')

In [36]:
sci1.to_csv('./data/scientist_2.csv', index=False)

In [40]:
# pickle : 파이썬의 객체형을 저장
sci1.to_pickle('./data/scientist.pickle')

In [41]:
df2 = pd.read_pickle('./data/scientist.pickle')
df2

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [37]:
df = pd.read_csv('./data/scientist_2.csv')
df

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [42]:
df1 = pd.read_csv('./data/scientists.csv')
df1

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

# 데이터 미리보기
1. info()
2. head()/tail()

In [43]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      object
 2   Died        8 non-null      object
 3   Age         8 non-null      int64
 4   Occupation  8 non-null      object
dtypes: int64(1), object(4)
memory usage: 452.0+ bytes

In [ ]:
df1.head(3) #default=5

                   Name        Born        Died  Age    Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist
1        William Gosset  1876-06-13  1937-10-16   61  Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse

In [47]:
df1.tail(3)

           Name        Born        Died  Age          Occupation
5     John Snow  1813-03-15  1858-06-16   45           Physician
6   Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7  Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [48]:
df1.describe()

             Age
count   8.000000
mean   59.125000
std    18.325918
min    37.000000
25%    44.000000
50%    58.500000
75%    68.750000
max    90.000000

In [49]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        8 non-null      object
 1   Born        8 non-null      object
 2   Died        8 non-null      object
 3   Age         8 non-null      int64
 4   Occupation  8 non-null      object
dtypes: int64(1), object(4)
memory usage: 452.0+ bytes

In [53]:
df1['Age'].describe()

count     8.000000
mean     59.125000
std      18.325918
min      37.000000
25%      44.000000
50%      58.500000
75%      68.750000
max      90.000000
Name: Age, dtype: float64

In [52]:
df1.loc[:,'Age']

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [54]:
data = {
    '이름': ['김철수', '이영희', '박민수', '정수진', '최영호', '한미래', '윤지원'],
    '나이': [25, 28, 22, 31, 27, 24, 29],
    '점수': [85, 92, 78, 95, 88, 73, 91]
}
df = pd.DataFrame(data)
df

    이름  나이  점수
0  김철수  25  85
1  이영희  28  92
2  박민수  22  78
3  정수진  31  95
4  최영호  27  88
5  한미래  24  73
6  윤지원  29  91

In [55]:
df.index

RangeIndex(start=0, stop=7, step=1)

In [56]:
df.columns

Index(['이름', '나이', '점수'], dtype='object')

In [59]:
df.columns = ['name', 'age', 'score']

In [60]:
df

  name  age  score
0  김철수   25     85
1  이영희   28     92
2  박민수   22     78
3  정수진   31     95
4  최영호   27     88
5  한미래   24     73
6  윤지원   29     91

In [57]:
df.shape

(7, 3)

In [58]:
df.values

array([['김철수', 25, 85],
       ['이영희', 28, 92],
       ['박민수', 22, 78],
       ['정수진', 31, 95],
       ['최영호', 27, 88],
       ['한미래', 24, 73],
       ['윤지원', 29, 91]], dtype=object)